import os
from colorama import init
from colorama import Fore, Back, Style
init()
print(Fore.GREEN)
print("Generator Started!")                                      

anketa= [" "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "," "]
anketa[0] = input("[1/96] Введите имя жертвы с большой буквы: ")
anketa[1] = input("[2/96] Введите имя жертвы с маленькой буквы: ")
anketa[2] = input("[3/96] Введите имя жертвы в другой форме с большой буквы: ")
anketa[3] = input("[4/96] Введите имя жертвы в другой форме с маленькой буквы: ")
anketa[4] = input("[5/96] Введите имя жертвы с английской раскладки (Н-р: fylhtq - андрей): ")
anketa[5] = input("[6/96] Введите псевдоним жертвы с большой буквы: ")
anketa[6] = input("[7/96] Введите псевдоним жертвы с маленькой буквы: ")
anketa[7] = input("[8/96] Введите второй псевдоним жертвы с большой буквы: ")
anketa[8] = input("[9/96] Введите второй псевдоним жертвы с маленькой буквы: ")
anketa[9] = input("[10/96] Введите фамилию жертвы с большой буквы: ")
anketa[10] = input("[11/96] Введите отчество жертвы с маленькой буквы: ")
anketa[11] = input("[12/96] Введите имя жертвы, которое она/она использует в соц. сетях с большой буквы: ")
anketa[12] = input("[13/96] Введите имя жертвы, которое она/она использует в соц. сетях с маленькой буквы: ")
anketa[13] = input("[14/96] Введите второе имя жертвы, которое она/она использует в соц. сетях с большой буквы: ")
anketa[14] = input("[15/96] Введите второе имя жертвы, которое она/она использует в соц. сетях с маленькой буквы: ")
anketa[15] = input("[16/96] Введите дату (без точек между месяцем, днем и годом) рождения жертвы: ")
anketa[16]= input("[17/96] Введите возраст жертвы: ")
anketa[17] = input("[18/96] Введите дату рождения - месяц латинецей с большой буквы: ")
anketa[18] = input("[19/96] Введите дату рождения - месяц латинецей с маленькой буквы: ")
anketa[19] = input("[20/96] Введите дату рождения - месяц по-английски с большой буквы: ")
anketa[20] = input("[21/96] Введите дату рождения - месяц по-английски с маленькой буквы: ")
anketa[21] = input("[22/96] Введите дату рождения - месяц цифрой: ")
anketa[22] = input("[23/96] Введите день(например - пятница) рождения - цифрой: ")
anketa[23] = input("[24/96] Введите день(например - пятница) латинецей с большой буквы: ")
anketa[24] = input("[25/96] Введите день(например - пятница) латинецей с маленькой буквы: ")
anketa[25] = input("[26/96] Введите день(например - пятница) по-английски с большой буквы: ")
anketa[26] = input("[27/96] Введите день(например - пятница) по-английски с маленькой буквы: ")
anketa[27] = input("[28/96] Введите год рождения жертвы: ")
anketa[28] = input("[29/96] Введите номер телефона жертвы: ")
anketa[29] = input("[30/96] Введите любую часть номера телефона жертвы: ")
anketa[30] = input("[31/96] Введите город жертвы с большой буквы, в котором он/она родилась: ")
anketa[31] = input("[32/96] Введите город жертвы с маленькой буквы, в котором он/она родилась: ")
anketa[32] = input("[33/96] Введите город жертвы абревиатурой с маленькой буквы, в котором он/она родилась: ")
anketa[33] = input("[34/96] Введите город жертвы абревиатурой с большой буквы, в котором он/она родилась: ")
anketa[34] = input("[35/96] Введите город жертвы абревиатурой, все буквы большие, в котором он/она родилась: ")
anketa[35] = input("[36/96] Введите город в котором проживает жертва с большой буквы: ")
anketa[36] = input("[37/96] Введите город в котором проживает жертва с маленькой буквы: ")
anketa[37] = input("[38/96] Введите город в котором проживает жертва абревиатурой, с маленькой буквы: ")
anketa[38] = input("[39/96] Введите город в котором проживает жертва абревиатурой, с большой буквы: ")
anketa[39] = input("[40/96] Введите город в котором проживает жертва абревиатурой, все буквы большие: ")
anketa[40] = input("[41/96] Какую группу любит слушать жертва (с маленькой буквы)? ")
anketa[41] = input("[42/96] Какую группу любит слушать жертва (с большой буквы)? ")
anketa[42] = input("[43/96] Какую группу любит слушать жертва, абревиатурой (с большой буквы)? ")
anketa[43] = input("[44/96] Какую группу любит слушать жертва, абревиатурой (с маленькой буквы)? ")
anketa[44] = input("[44/96] Какую группу любит слушать жертва, абревиатурой (все буквы большие)? ")
anketa[45] = input("[45/96] Какой жанр музыки любит жертва (с большой буквы)? ")
anketa[46] = input("[46/96] Какой жанр музыки любит жертва (с маленькой буквы)? ")
anketa[47] = input("[47/96] Какой жанр фильмов любит жертва ( с большой буквы)? ")
anketa[48] = input("[48/96] Какой жанр фильмов любит жертва ( с маленькой буквы)? ")
anketa[49] = input("[49/96] Какой жанр игр любит жертва (с большой буквы)? ")
anketa[50] = input("[50/96] Какой жанр игр любит жертва (с маленькой буквы)? ")
anketa[51]= input("[51/96] Какого пеца любит жертва (с большой буквы)? ")
anketa[52]= input("[52/96] Какого пеца любит жертва (с маленькой буквы)? ")
anketa[53] = input("[53/96] В каком году родился певец? ")
anketa[54] = input("[54/96] Какого актера любит жертва (с большой буквы)? ")
anketa[55] = input("[55/96] Какого актера любит жертва (с маленькой буквы)? ")
anketa[56] = input("[56/96] В каком году родился актер? ")
anketa[57] = input("[57/96] Какого персонажа фильма любит жертва (с большой буквы)? ")
anketa[58] = input("[58/96] Какого персонажа фильма любит жертва (с маленькой буквы)? ")
anketa[59]= input("[59/94] Какого персонажа игры любит жертва (с большой буквы)? ")
anketa[60]= input("[60/96] Какого персонажа игры любит жертва (с маленькой буквы)? ")
anketa[61] = input("[61/96] Какой творческой деятельностью любит заниматься жертва (с большой буквы)? ")
anketa[62] = input("[62/96] Какой творческой деятельностью любит заниматься жертва (с маленькой буквы)? ")
anketa[63]= input("[63/96] Род деятельности жертвы (с большой буквы): Если работа, то какая? (например - строитель) Если это школа - то school, если колледж - то college: ")
anketa[64]= input("[64/96] Род деятельности жертвы (с маленькой буквы): Если работа, то какая? (например - строитель) Если это школа - то school, если колледж - то college: ")
####################################################################################################################################################################################
######     FATHER
####################################################################################################################################################################################
anketa[65] = input("[65/96] Как зовут папу жертвы (с большой буквы)? ")
anketa[66] = input("[66/96] Как зовут папу жертвы (с маленькой буквы)? ")
anketa[67] = input("[67/96] Какая дата рождения отца жертвы: ")
anketa[68] = input("[68/96] Место работы отца жертвы (с большой буквы): ")
anketa[69] = input("[69/96] Место работы отца жертвы (с маленькой буквы): ")
anketa[70] = input("[70/96] Прозвище папы жертвы (с большой буквы): ")
anketa[71] = input("[72/96] Прозвище папы жертвы (с маленькой буквы): ")
anketa[72] = input("[73/96] Номер телефона папы жертвы: ")
#####################################################################################################################################################################################
######    MOTHER 
#####################################################################################################################################################################################
anketa[73] = input("[74/96] Как зовут маму жертвы (с большой буквы)? ")
anketa[74] = input("[75/96] Как зовут маму жертвы (с маленькой буквы)? ")
anketa[75]= input("[76/96] Какая дата рождения матери жертвы: ")
anketa[76] = input("[77/96] Место работы мамы жертвы (с большой буквы): ")
anketa[77] = input("[78/96] Место работы мамы жертвы (с маленькой буквы): ")
anketa[78] = input("[79/96] Прозвище мамы жертвы: ")
anketa[79] = input("[80/96] Номер телефона матери жертвы: ")
######################################################################################################################################################################################
######    BROTHER
######################################################################################################################################################################################
anketa[80]= input("[81/96] Как зовут брата жертвы? ")
anketa[81] = input("[82/96] Какая дата рождения брата жертвы: ")
anketa[82] = input("[83/96] Место работы брата(может это учеба - school/college) жертвы: ")
anketa[83] = input("[84/96] Прозвище брата жертвы: ")
anketa[84] = input("[85/96] Номер телефона брата жертвы: ")
########################################################################################################################################################################################
######    SISTER
#########################################################################################################################################################################################
anketa[85] = input("[86/96] Как зовут сестру жертвы? ")
anketa[86] = input("[87/96] Какая дата рождения сестры жертвы: ")
anketa[87] = input("[88/96] Место работы сестры(может это учеба - school/college) жертвы: ")
anketa[88] = input("[89/96] Прозвище сестры жертвы: ")
anketa[89] = input("[90/96] Номер телефона сестры жертвы: ")
############################################################################################################################################################################################
######    FRIEND
#############################################################################################################################################################################################
anketa[90] = input("[91/96]Как зовут друга жертвы (с большой буквы)? ")
anketa[91] = input("[92/96]Как зовут друга жертвы (с маленькой буквы)? ")
anketa[92] = input("[93/96]Какая дата рождения друга жертвы: ")
anketa[93] = input("[94/96]Место работы друга(может это учеба - school/college) жертвы: ")
anketa[94] = input("[95/96]Прозвище друга жертвы: ")
anketa[95] = input("[96/96]Номер телефона друга жертвы: ")
###############################################################################################################################################################################################
################################################################################################################################################################################################
makefile = input("Как будет называться файл? ")
recordf = open(makefile, "w+")
x=0
y=0
i=0
for x in range(95):
    for y in range(95):
        for i in range(95):
            recordf.write(anketa[x] + anketa[y] + anketa[i]+ "\n")
for x in range(95):
    for y in range(95):
        recordf.write(anketa[x] + anketa[y] + "\n")
recordf.close()
print("Словарь создан!")
